In [1]:
import pandas as pd

In [4]:
df = pd.read_csv('./assets/Students_exams.csv', sep=";")
df.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

In [5]:
gender = df["gender"]
gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [6]:
students_math = df[["gender", "math score"]]
students_math

     gender  math score
0    female          72
1    female          69
2    female          90
3      male          47
4      male          76
..      ...         ...
995  female          88
996    male          62
997  female          59
998  female          68
999  female          77

[1000 rows x 2 columns]

In [8]:
rows = df[2:7]
rows

   gender  math score  reading score  writing score
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75
5  female          71             83             78
6  female          88             95             92

In [10]:
result = df.loc[0]
result

gender           female
math score           72
reading score        72
writing score        74
Name: 0, dtype: object

In [11]:
res = df.loc[[1, 3, 989]]
res

     gender  math score  reading score  writing score
1    female          69             90             88
3      male          47             57             44
989  female          67             86             83

In [12]:
res = df.loc[[1, 3, 989], ['reading score']]
res

     reading score
1               90
3               57
989             86

In [14]:
res = df.loc[10:20, ['gender', 'reading score']]
res

    gender  reading score
10    male             54
11    male             52
12  female             81
13    male             72
14  female             53
15  female             75
16    male             89
17  female             32
18    male             42
19  female             58
20    male             69

In [15]:
df

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

In [16]:
df.iloc[0]

gender           female
math score           72
reading score        72
writing score        74
Name: 0, dtype: object

In [ ]:
df.iloc[[1:999], []